my_list = 'red, white, black, red, green, black'.split()  # Создаем список
my_list.sort()  # Сортируем список
print(my_list)  # Выводим результат

'''
Задача 5. 15 баллов.
Тема приведение типов. Работа со списком. Расчленение строки и ее соединение.
Пользователь вводит через запятую последовательность слов например цвета или продукты.
Программа возвращает уникальные слова отсортированные по алфавиту.
Входные данные: red, white, black, red, green, black
Результат: black, green, red, white, red
'''
